src/cf/InformationRegisters/ФайлыСозданныеПоШаблону.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ФайлыСозданныеПоШаблону</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СозданПоШаблону</Name>
					<Comment>Создан из файла, указанного в шаблоне документов</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ФайлыСозданныеПоШаблону/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Занести данные о файле в регистре
//
Процедура ЗанестиИнформациюОФайле(Файл, СозданПоШаблону) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = РегистрыСведений.ФайлыСозданныеПоШаблону.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Файл = Файл;
	МенеджерЗаписи.СозданПоШаблону = СозданПоШаблону;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры


// Получить данные о файле в регистре
Функция ПолучитьФайлСозданПоШаблону(Файл) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = РегистрыСведений.ФайлыСозданныеПоШаблону.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Файл = Файл;
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		Возврат МенеджерЗаписи.СозданПоШаблону;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецЕсли
